ea3140/app/Models/UsersModel.php

    public function getUsers(){

        $builder = $this->db->table('users');
        $query = $builder->get();
---
SELECT *
FROM `users`

    public function addUser($data){

        $builder = $this->db->table('users');
        $builder->insert($data);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `nic`, `username`, `user_type`, `user_status`, `password`) VALUES ('Ajith', 'Perera', 'ajith@gmail.com', '713542806V', 'ajith@gmail.com', '90', '1', '$2y$10$RkCH7qabkKLibye1N8THOOQNBjlm8ACN33mM0DAKd32R4tFiDlqLu')