app/Models/CoursesModel.php

    public function getCourses(){
        $builder = $this->db->table('courses');
        $query = $builder->get();
---
SELECT *
FROM `courses`

    public function addCourse($data){
        $builder = $this->db->table('courses');
        $builder->insert($data);
---
INSERT INTO `courses` (`course_code`, `course_title`, `credits`) VALUES ('EA3156', 'Ai', '3')

    public function addStudentCourse($data){
        $builder = $this->db->table('student_courses');
        $builder->insert($data);
---
INSERT INTO `student_courses` (`student_id`, `course_id`) VALUES ('1', '1')

    public function getStudentCourses(){
        $builder = $this->db->table('student_courses');
        $builder->join('students', 'students.student_id = student_courses.student_id');
        $builder->join('courses', 'courses.course_id = student_courses.course_id');
        $builder->select('students.reg_no, students.name_with_initials, courses.course_code, courses.course_title');
        $query = $builder->get();
---
SELECT `students`.`reg_no`, `students`.`name_with_initials`, `courses`.`course_code`, `courses`.`course_title`
FROM `student_courses`
JOIN `students` ON `students`.`student_id` = `student_courses`.`student_id`
JOIN `courses` ON `courses`.`course_id` = `student_courses`.`course_id`