app/Models/LoginModel.php

SELECT *
FROM `users`
WHERE `email` = 'ajith@gmail.com'
---
    public function verifyEmail($email){

        $builder = $this->db->table('users');
        $builder->where('email', $email);
        $query = $builder->get();