app/Models/StudentsModel.php

SELECT *
FROM `students`
---
    public function getStudents(){
        $builder = $this->db->table('students');
        $query = $builder->get();

INSERT INTO `students` (`reg_no`, `first_name`, `last_name`, `name_with_initials`, `nic`) VALUES ('23sae035', 'Atheek', 'Ahmath', 'Atheek Ahmath', '200120904421')
---
    public function addStudent($data){
        $builder = $this->db->table('students');
        $builder->insert($data);