app/Models/UsersModel.php

SELECT *
FROM `users`
JOIN `user_type` ON `user_type`.`user_type_id` = `users`.`user_type`
---
    public function getUsers(){

        $builder = $this->db->table('users');
        $builder->join('user_type', 'user_type.user_type_id = users.user_type');
        $query = $builder->get();